ut/src/InformationRegisters/ДокументыОПредстоящейПоставке/ДокументыОПредстоящейПоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДокументыОПредстоящейПоставке</name>
  <resources>
    <name>СуммаНалога</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеДОПП</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДатаВвоза</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПодакцизногоТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КБК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерДОПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ut/src/InformationRegisters/ДокументыОПредстоящейПоставке/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Организация) Тогда
		Запись.Организация = Параметры.Организация;
		КодБКНДС = Параметры.КодБКНДС;
		Если ЗначениеЗаполнено(Параметры.КодыБК) Тогда
			ТаблицаКБК = ОбщегоНазначенияУТ.МассивВТаблицуЗначений(Параметры.КодыБК);
			КодыБК.Загрузить(ТаблицаКБК);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КодБКНДС) Тогда
		
		КодБКНДСВидНалога = "";
		
		
		КодБКНДС = РегистрыСведений.ДокументыОПредстоящейПоставке.УточнитьКБК(КодБКНДСВидНалога);
		
		КодыБК.Загрузить(РегистрыСведений.ДокументыОПредстоящейПоставке.ПолучитьКодыБК(КодБКНДС));
		
	КонецЕсли;
	СуммаДокумента = Параметры.СуммаДокумента;
	УрезанныйВариант = Параметры.УрезанныйВариант;
	
	УстановитьВидимость(Элементы.ДатаСобытия, Запись.Состояние);
	УстановитьУсловноеОформление();
	
	Элементы.Организация.Видимость = Не УрезанныйВариант;
	Элементы.Контрагент.Видимость = Не УрезанныйВариант;
	Элементы.КБК.Видимость = Не УрезанныйВариант;
	Элементы.КатегорияПодакцизногоТовара.Видимость = Не УрезанныйВариант;
	Элементы.НомерДОПП.ТолькоПросмотр = УрезанныйВариант;

	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Запись.Состояние) И Не ЗначениеЗаполнено(Запись.ДатаСобытия) Тогда
	
		ОчиститьСообщения();
		Если Запись.Состояние = ПредопределенноеЗначение("Перечисление.СостояниеДОПП.ПоставкаОтменена") Тогда
			ТекстСообщения = НСтр("ru='Поле ""Дата отмены поставки"" не заполнено'");
		Иначе
			ТекстСообщения = НСтр("ru='Поле ""Дата принятия к учету"" не заполнено'");
		КонецЕсли;
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.Состояние) Тогда
		Запись.ДатаСобытия = Дата(1,1,1);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.Состояние) И ЗначениеЗаполнено(СуммаДокумента) Тогда
		Запись.СуммаНалога = СуммаДокумента;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	Если ЗначениеЗаполнено(СуммаДокумента) И Запись.СуммаНалога < СуммаДокумента Тогда
		
		МетаданныеРегистра    = Метаданные.РегистрыСведений.ДокументыОПредстоящейПоставке;
		ПолноеИмяРегистра     = МетаданныеРегистра.ПолноеИмя();
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяРегистра);
			ЭлементБлокировки.УстановитьЗначение("Организация", Запись.Организация);
			ЭлементБлокировки.УстановитьЗначение("НомерДОПП",   Запись.НомерДОПП);
			ЭлементБлокировки.УстановитьЗначение("ДатаСобытия", Дата(1,1,1));
			Блокировка.Заблокировать();
			
			НаборЗаписей = РегистрыСведений.ДокументыОПредстоящейПоставке.СоздатьНаборЗаписей();
			НаборЗаписей.Заполнить(Неопределено);
			НаборЗаписей.Отбор.Организация.Установить(Запись.Организация);
			НаборЗаписей.Отбор.НомерДОПП.Установить(Запись.НомерДОПП);
			НаборЗаписей.Отбор.КБК.Установить(Запись.КБК);
			НаборЗаписей.Отбор.ДатаСобытия.Установить(Дата(1,1,1));
			
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Запись);
			НоваяЗапись.Состояние = Перечисления.СостояниеДОПП.ПустаяСсылка();
			НоваяЗапись.ДатаСобытия = Дата(1,1,1);
			НоваяЗапись.СуммаНалога = СуммаДокумента - Запись.СуммаНалога;
			
			НаборЗаписей.Записать();
			
			ЗафиксироватьТранзакцию();
				
		Исключение
				
			ОтменитьТранзакцию();
				
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось записать изменения по ДОПП №%1 по причине:
				|%2'"), Запись.НомерДОПП, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_РегистрДокументыОПредстоящейПоставке", Запись.НомерДОПП);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КБКНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеВключенияВДекларациюПриИзменении(Элемент)
	
	УстановитьВидимость(Элементы.ДатаСобытия, Запись.Состояние);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимость(Элемент, Состояние)
	
	Элемент.Видимость = ЗначениеЗаполнено(Состояние);
	Если Состояние = ПредопределенноеЗначение("Перечисление.СостояниеДОПП.ПоставкаОтменена") Тогда
		Элемент.Заголовок = НСтр("ru='Дата отмены поставки'");
	ИначеЕсли Состояние = ПредопределенноеЗначение("Перечисление.СостояниеДОПП.ПоставкаПроизошла") Тогда
		Элемент.Заголовок = НСтр("ru='Дата принятия к учету'");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОснованиеВключенияВДекларацию");
	
	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Запись.Состояние");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Поставка ожидается'"));
	
	ОтборЭлемента.Использование = Истина;
	
КонецПроцедуры

#КонецОбласти
